RIOT-OS/RIOT/cpu/ezr32lg/include/ezr32lg_usartrf.h
/* Bit fields for USARTRF FRAME */
#define _USARTRF_FRAME_RESETVALUE               0x00001005UL                                /**< Default value for USARTRF_FRAME */
#define _USARTRF_FRAME_MASK                     0x0000330FUL                                /**< Mask for USARTRF_FRAME */
#define _USARTRF_FRAME_DATABITS_SHIFT           0                                           /**< Shift value for USART_DATABITS */
#define _USARTRF_FRAME_DATABITS_MASK            0xFUL                                       /**< Bit mask for USART_DATABITS */
#define _USARTRF_FRAME_DATABITS_FOUR            0x00000001UL                                /**< Mode FOUR for USARTRF_FRAME */
#define _USARTRF_FRAME_DATABITS_FIVE            0x00000002UL                                /**< Mode FIVE for USARTRF_FRAME */
#define _USARTRF_FRAME_DATABITS_SIX             0x00000003UL                                /**< Mode SIX for USARTRF_FRAME */
#define _USARTRF_FRAME_DATABITS_SEVEN           0x00000004UL                                /**< Mode SEVEN for USARTRF_FRAME */
#define _USARTRF_FRAME_DATABITS_DEFAULT         0x00000005UL                                /**< Mode DEFAULT for USARTRF_FRAME */
#define _USARTRF_FRAME_DATABITS_EIGHT           0x00000005UL                                /**< Mode EIGHT for USARTRF_FRAME */
#define _USARTRF_FRAME_DATABITS_NINE            0x00000006UL                                /**< Mode NINE for USARTRF_FRAME */
#define _USARTRF_FRAME_DATABITS_TEN             0x00000007UL                                /**< Mode TEN for USARTRF_FRAME */
#define _USARTRF_FRAME_DATABITS_ELEVEN          0x00000008UL                                /**< Mode ELEVEN for USARTRF_FRAME */
#define _USARTRF_FRAME_DATABITS_TWELVE          0x00000009UL                                /**< Mode TWELVE for USARTRF_FRAME */
#define _USARTRF_FRAME_DATABITS_THIRTEEN        0x0000000AUL                                /**< Mode THIRTEEN for USARTRF_FRAME */
#define _USARTRF_FRAME_DATABITS_FOURTEEN        0x0000000BUL                                /**< Mode FOURTEEN for USARTRF_FRAME */
#define _USARTRF_FRAME_DATABITS_FIFTEEN         0x0000000CUL                                /**< Mode FIFTEEN for USARTRF_FRAME */
#define _USARTRF_FRAME_DATABITS_SIXTEEN         0x0000000DUL                                /**< Mode SIXTEEN for USARTRF_FRAME */
#define USARTRF_FRAME_DATABITS_FOUR             (_USARTRF_FRAME_DATABITS_FOUR << 0)         /**< Shifted mode FOUR for USARTRF_FRAME */
#define USARTRF_FRAME_DATABITS_FIVE             (_USARTRF_FRAME_DATABITS_FIVE << 0)         /**< Shifted mode FIVE for USARTRF_FRAME */
#define USARTRF_FRAME_DATABITS_SIX              (_USARTRF_FRAME_DATABITS_SIX << 0)          /**< Shifted mode SIX for USARTRF_FRAME */
#define USARTRF_FRAME_DATABITS_SEVEN            (_USARTRF_FRAME_DATABITS_SEVEN << 0)        /**< Shifted mode SEVEN for USARTRF_FRAME */
#define USARTRF_FRAME_DATABITS_DEFAULT          (_USARTRF_FRAME_DATABITS_DEFAULT << 0)      /**< Shifted mode DEFAULT for USARTRF_FRAME */
#define USARTRF_FRAME_DATABITS_EIGHT            (_USARTRF_FRAME_DATABITS_EIGHT << 0)        /**< Shifted mode EIGHT for USARTRF_FRAME */
#define USARTRF_FRAME_DATABITS_NINE             (_USARTRF_FRAME_DATABITS_NINE << 0)         /**< Shifted mode NINE for USARTRF_FRAME */
#define USARTRF_FRAME_DATABITS_TEN              (_USARTRF_FRAME_DATABITS_TEN << 0)          /**< Shifted mode TEN for USARTRF_FRAME */
#define USARTRF_FRAME_DATABITS_ELEVEN           (_USARTRF_FRAME_DATABITS_ELEVEN << 0)       /**< Shifted mode ELEVEN for USARTRF_FRAME */
#define USARTRF_FRAME_DATABITS_TWELVE           (_USARTRF_FRAME_DATABITS_TWELVE << 0)       /**< Shifted mode TWELVE for USARTRF_FRAME */
#define USARTRF_FRAME_DATABITS_THIRTEEN         (_USARTRF_FRAME_DATABITS_THIRTEEN << 0)     /**< Shifted mode THIRTEEN for USARTRF_FRAME */
#define USARTRF_FRAME_DATABITS_FOURTEEN         (_USARTRF_FRAME_DATABITS_FOURTEEN << 0)     /**< Shifted mode FOURTEEN for USARTRF_FRAME */
#define USARTRF_FRAME_DATABITS_FIFTEEN          (_USARTRF_FRAME_DATABITS_FIFTEEN << 0)      /**< Shifted mode FIFTEEN for USARTRF_FRAME */
#define USARTRF_FRAME_DATABITS_SIXTEEN          (_USARTRF_FRAME_DATABITS_SIXTEEN << 0)      /**< Shifted mode SIXTEEN for USARTRF_FRAME */
#define _USARTRF_FRAME_PARITY_SHIFT             8                                           /**< Shift value for USART_PARITY */
#define _USARTRF_FRAME_PARITY_MASK              0x300UL                                     /**< Bit mask for USART_PARITY */
#define _USARTRF_FRAME_PARITY_DEFAULT           0x00000000UL                                /**< Mode DEFAULT for USARTRF_FRAME */
#define _USARTRF_FRAME_PARITY_NONE              0x00000000UL                                /**< Mode NONE for USARTRF_FRAME */
#define _USARTRF_FRAME_PARITY_EVEN              0x00000002UL                                /**< Mode EVEN for USARTRF_FRAME */
#define _USARTRF_FRAME_PARITY_ODD               0x00000003UL                                /**< Mode ODD for USARTRF_FRAME */
#define USARTRF_FRAME_PARITY_DEFAULT            (_USARTRF_FRAME_PARITY_DEFAULT << 8)        /**< Shifted mode DEFAULT for USARTRF_FRAME */
#define USARTRF_FRAME_PARITY_NONE               (_USARTRF_FRAME_PARITY_NONE << 8)           /**< Shifted mode NONE for USARTRF_FRAME */
#define USARTRF_FRAME_PARITY_EVEN               (_USARTRF_FRAME_PARITY_EVEN << 8)           /**< Shifted mode EVEN for USARTRF_FRAME */
#define USARTRF_FRAME_PARITY_ODD                (_USARTRF_FRAME_PARITY_ODD << 8)            /**< Shifted mode ODD for USARTRF_FRAME */
#define _USARTRF_FRAME_STOPBITS_SHIFT           12                                          /**< Shift value for USART_STOPBITS */
#define _USARTRF_FRAME_STOPBITS_MASK            0x3000UL                                    /**< Bit mask for USART_STOPBITS */
#define _USARTRF_FRAME_STOPBITS_HALF            0x00000000UL                                /**< Mode HALF for USARTRF_FRAME */
#define _USARTRF_FRAME_STOPBITS_DEFAULT         0x00000001UL                                /**< Mode DEFAULT for USARTRF_FRAME */
#define _USARTRF_FRAME_STOPBITS_ONE             0x00000001UL                                /**< Mode ONE for USARTRF_FRAME */
#define _USARTRF_FRAME_STOPBITS_ONEANDAHALF     0x00000002UL                                /**< Mode ONEANDAHALF for USARTRF_FRAME */
#define _USARTRF_FRAME_STOPBITS_TWO             0x00000003UL                                /**< Mode TWO for USARTRF_FRAME */
#define USARTRF_FRAME_STOPBITS_HALF             (_USARTRF_FRAME_STOPBITS_HALF << 12)        /**< Shifted mode HALF for USARTRF_FRAME */
#define USARTRF_FRAME_STOPBITS_DEFAULT          (_USARTRF_FRAME_STOPBITS_DEFAULT << 12)     /**< Shifted mode DEFAULT for USARTRF_FRAME */
#define USARTRF_FRAME_STOPBITS_ONE              (_USARTRF_FRAME_STOPBITS_ONE << 12)         /**< Shifted mode ONE for USARTRF_FRAME */
#define USARTRF_FRAME_STOPBITS_ONEANDAHALF      (_USARTRF_FRAME_STOPBITS_ONEANDAHALF << 12) /**< Shifted mode ONEANDAHALF for USARTRF_FRAME */
#define USARTRF_FRAME_STOPBITS_TWO              (_USARTRF_FRAME_STOPBITS_TWO << 12)         /**< Shifted mode TWO for USARTRF_FRAME */

/* Bit fields for USARTRF TRIGCTRL */
#define _USARTRF_TRIGCTRL_RESETVALUE            0x00000000UL                               /**< Default value for USARTRF_TRIGCTRL */
#define _USARTRF_TRIGCTRL_MASK                  0x00000077UL                               /**< Mask for USARTRF_TRIGCTRL */
#define _USARTRF_TRIGCTRL_TSEL_SHIFT            0                                          /**< Shift value for USART_TSEL */
#define _USARTRF_TRIGCTRL_TSEL_MASK             0x7UL                                      /**< Bit mask for USART_TSEL */
#define _USARTRF_TRIGCTRL_TSEL_DEFAULT          0x00000000UL                               /**< Mode DEFAULT for USARTRF_TRIGCTRL */
#define _USARTRF_TRIGCTRL_TSEL_PRSCH0           0x00000000UL                               /**< Mode PRSCH0 for USARTRF_TRIGCTRL */
#define _USARTRF_TRIGCTRL_TSEL_PRSCH1           0x00000001UL                               /**< Mode PRSCH1 for USARTRF_TRIGCTRL */
#define _USARTRF_TRIGCTRL_TSEL_PRSCH2           0x00000002UL                               /**< Mode PRSCH2 for USARTRF_TRIGCTRL */
#define _USARTRF_TRIGCTRL_TSEL_PRSCH3           0x00000003UL                               /**< Mode PRSCH3 for USARTRF_TRIGCTRL */
#define _USARTRF_TRIGCTRL_TSEL_PRSCH4           0x00000004UL                               /**< Mode PRSCH4 for USARTRF_TRIGCTRL */
#define _USARTRF_TRIGCTRL_TSEL_PRSCH5           0x00000005UL                               /**< Mode PRSCH5 for USARTRF_TRIGCTRL */
#define _USARTRF_TRIGCTRL_TSEL_PRSCH6           0x00000006UL                               /**< Mode PRSCH6 for USARTRF_TRIGCTRL */
#define _USARTRF_TRIGCTRL_TSEL_PRSCH7           0x00000007UL                               /**< Mode PRSCH7 for USARTRF_TRIGCTRL */
#define USARTRF_TRIGCTRL_TSEL_DEFAULT           (_USARTRF_TRIGCTRL_TSEL_DEFAULT << 0)      /**< Shifted mode DEFAULT for USARTRF_TRIGCTRL */
#define USARTRF_TRIGCTRL_TSEL_PRSCH0            (_USARTRF_TRIGCTRL_TSEL_PRSCH0 << 0)       /**< Shifted mode PRSCH0 for USARTRF_TRIGCTRL */
#define USARTRF_TRIGCTRL_TSEL_PRSCH1            (_USARTRF_TRIGCTRL_TSEL_PRSCH1 << 0)       /**< Shifted mode PRSCH1 for USARTRF_TRIGCTRL */
#define USARTRF_TRIGCTRL_TSEL_PRSCH2            (_USARTRF_TRIGCTRL_TSEL_PRSCH2 << 0)       /**< Shifted mode PRSCH2 for USARTRF_TRIGCTRL */
#define USARTRF_TRIGCTRL_TSEL_PRSCH3            (_USARTRF_TRIGCTRL_TSEL_PRSCH3 << 0)       /**< Shifted mode PRSCH3 for USARTRF_TRIGCTRL */
#define USARTRF_TRIGCTRL_TSEL_PRSCH4            (_USARTRF_TRIGCTRL_TSEL_PRSCH4 << 0)       /**< Shifted mode PRSCH4 for USARTRF_TRIGCTRL */
#define USARTRF_TRIGCTRL_TSEL_PRSCH5            (_USARTRF_TRIGCTRL_TSEL_PRSCH5 << 0)       /**< Shifted mode PRSCH5 for USARTRF_TRIGCTRL */
#define USARTRF_TRIGCTRL_TSEL_PRSCH6            (_USARTRF_TRIGCTRL_TSEL_PRSCH6 << 0)       /**< Shifted mode PRSCH6 for USARTRF_TRIGCTRL */
#define USARTRF_TRIGCTRL_TSEL_PRSCH7            (_USARTRF_TRIGCTRL_TSEL_PRSCH7 << 0)       /**< Shifted mode PRSCH7 for USARTRF_TRIGCTRL */
#define USARTRF_TRIGCTRL_RXTEN                  (0x1UL << 4)                               /**< Receive Trigger Enable */
#define _USARTRF_TRIGCTRL_RXTEN_SHIFT           4                                          /**< Shift value for USART_RXTEN */
#define _USARTRF_TRIGCTRL_RXTEN_MASK            0x10UL                                     /**< Bit mask for USART_RXTEN */
#define _USARTRF_TRIGCTRL_RXTEN_DEFAULT         0x00000000UL                               /**< Mode DEFAULT for USARTRF_TRIGCTRL */
#define USARTRF_TRIGCTRL_RXTEN_DEFAULT          (_USARTRF_TRIGCTRL_RXTEN_DEFAULT << 4)     /**< Shifted mode DEFAULT for USARTRF_TRIGCTRL */
#define USARTRF_TRIGCTRL_TXTEN                  (0x1UL << 5)                               /**< Transmit Trigger Enable */
#define _USARTRF_TRIGCTRL_TXTEN_SHIFT           5                                          /**< Shift value for USART_TXTEN */
#define _USARTRF_TRIGCTRL_TXTEN_MASK            0x20UL                                     /**< Bit mask for USART_TXTEN */
#define _USARTRF_TRIGCTRL_TXTEN_DEFAULT         0x00000000UL                               /**< Mode DEFAULT for USARTRF_TRIGCTRL */
#define USARTRF_TRIGCTRL_TXTEN_DEFAULT          (_USARTRF_TRIGCTRL_TXTEN_DEFAULT << 5)     /**< Shifted mode DEFAULT for USARTRF_TRIGCTRL */
#define USARTRF_TRIGCTRL_AUTOTXTEN              (0x1UL << 6)                               /**< AUTOTX Trigger Enable */
#define _USARTRF_TRIGCTRL_AUTOTXTEN_SHIFT       6                                          /**< Shift value for USART_AUTOTXTEN */
#define _USARTRF_TRIGCTRL_AUTOTXTEN_MASK        0x40UL                                     /**< Bit mask for USART_AUTOTXTEN */
#define _USARTRF_TRIGCTRL_AUTOTXTEN_DEFAULT     0x00000000UL                               /**< Mode DEFAULT for USARTRF_TRIGCTRL */
#define USARTRF_TRIGCTRL_AUTOTXTEN_DEFAULT      (_USARTRF_TRIGCTRL_AUTOTXTEN_DEFAULT << 6) /**< Shifted mode DEFAULT for USARTRF_TRIGCTRL */

/* Bit fields for USARTRF CMD */
#define _USARTRF_CMD_RESETVALUE                 0x00000000UL                           /**< Default value for USARTRF_CMD */
#define _USARTRF_CMD_MASK                       0x00000FFFUL                           /**< Mask for USARTRF_CMD */
#define USARTRF_CMD_RXEN                        (0x1UL << 0)                           /**< Receiver Enable */
#define _USARTRF_CMD_RXEN_SHIFT                 0                                      /**< Shift value for USART_RXEN */
#define _USARTRF_CMD_RXEN_MASK                  0x1UL                                  /**< Bit mask for USART_RXEN */
#define _USARTRF_CMD_RXEN_DEFAULT               0x00000000UL                           /**< Mode DEFAULT for USARTRF_CMD */
#define USARTRF_CMD_RXEN_DEFAULT                (_USARTRF_CMD_RXEN_DEFAULT << 0)       /**< Shifted mode DEFAULT for USARTRF_CMD */
#define USARTRF_CMD_RXDIS                       (0x1UL << 1)                           /**< Receiver Disable */
#define _USARTRF_CMD_RXDIS_SHIFT                1                                      /**< Shift value for USART_RXDIS */
#define _USARTRF_CMD_RXDIS_MASK                 0x2UL                                  /**< Bit mask for USART_RXDIS */
#define _USARTRF_CMD_RXDIS_DEFAULT              0x00000000UL                           /**< Mode DEFAULT for USARTRF_CMD */
#define USARTRF_CMD_RXDIS_DEFAULT               (_USARTRF_CMD_RXDIS_DEFAULT << 1)      /**< Shifted mode DEFAULT for USARTRF_CMD */
#define USARTRF_CMD_TXEN                        (0x1UL << 2)                           /**< Transmitter Enable */
#define _USARTRF_CMD_TXEN_SHIFT                 2                                      /**< Shift value for USART_TXEN */
#define _USARTRF_CMD_TXEN_MASK                  0x4UL                                  /**< Bit mask for USART_TXEN */
#define _USARTRF_CMD_TXEN_DEFAULT               0x00000000UL                           /**< Mode DEFAULT for USARTRF_CMD */
#define USARTRF_CMD_TXEN_DEFAULT                (_USARTRF_CMD_TXEN_DEFAULT << 2)       /**< Shifted mode DEFAULT for USARTRF_CMD */
#define USARTRF_CMD_TXDIS                       (0x1UL << 3)                           /**< Transmitter Disable */
#define _USARTRF_CMD_TXDIS_SHIFT                3                                      /**< Shift value for USART_TXDIS */
#define _USARTRF_CMD_TXDIS_MASK                 0x8UL                                  /**< Bit mask for USART_TXDIS */
#define _USARTRF_CMD_TXDIS_DEFAULT              0x00000000UL                           /**< Mode DEFAULT for USARTRF_CMD */
#define USARTRF_CMD_TXDIS_DEFAULT               (_USARTRF_CMD_TXDIS_DEFAULT << 3)      /**< Shifted mode DEFAULT for USARTRF_CMD */
#define USARTRF_CMD_MASTEREN                    (0x1UL << 4)                           /**< Master Enable */
#define _USARTRF_CMD_MASTEREN_SHIFT             4                                      /**< Shift value for USART_MASTEREN */
#define _USARTRF_CMD_MASTEREN_MASK              0x10UL                                 /**< Bit mask for USART_MASTEREN */
#define _USARTRF_CMD_MASTEREN_DEFAULT           0x00000000UL                           /**< Mode DEFAULT for USARTRF_CMD */
#define USARTRF_CMD_MASTEREN_DEFAULT            (_USARTRF_CMD_MASTEREN_DEFAULT << 4)   /**< Shifted mode DEFAULT for USARTRF_CMD */
#define USARTRF_CMD_MASTERDIS                   (0x1UL << 5)                           /**< Master Disable */
#define _USARTRF_CMD_MASTERDIS_SHIFT            5                                      /**< Shift value for USART_MASTERDIS */
#define _USARTRF_CMD_MASTERDIS_MASK             0x20UL                                 /**< Bit mask for USART_MASTERDIS */
#define _USARTRF_CMD_MASTERDIS_DEFAULT          0x00000000UL                           /**< Mode DEFAULT for USARTRF_CMD */
#define USARTRF_CMD_MASTERDIS_DEFAULT           (_USARTRF_CMD_MASTERDIS_DEFAULT << 5)  /**< Shifted mode DEFAULT for USARTRF_CMD */
#define USARTRF_CMD_RXBLOCKEN                   (0x1UL << 6)                           /**< Receiver Block Enable */
#define _USARTRF_CMD_RXBLOCKEN_SHIFT            6                                      /**< Shift value for USART_RXBLOCKEN */
#define _USARTRF_CMD_RXBLOCKEN_MASK             0x40UL                                 /**< Bit mask for USART_RXBLOCKEN */
#define _USARTRF_CMD_RXBLOCKEN_DEFAULT          0x00000000UL                           /**< Mode DEFAULT for USARTRF_CMD */
#define USARTRF_CMD_RXBLOCKEN_DEFAULT           (_USARTRF_CMD_RXBLOCKEN_DEFAULT << 6)  /**< Shifted mode DEFAULT for USARTRF_CMD */
#define USARTRF_CMD_RXBLOCKDIS                  (0x1UL << 7)                           /**< Receiver Block Disable */
#define _USARTRF_CMD_RXBLOCKDIS_SHIFT           7                                      /**< Shift value for USART_RXBLOCKDIS */
#define _USARTRF_CMD_RXBLOCKDIS_MASK            0x80UL                                 /**< Bit mask for USART_RXBLOCKDIS */
#define _USARTRF_CMD_RXBLOCKDIS_DEFAULT         0x00000000UL                           /**< Mode DEFAULT for USARTRF_CMD */
#define USARTRF_CMD_RXBLOCKDIS_DEFAULT          (_USARTRF_CMD_RXBLOCKDIS_DEFAULT << 7) /**< Shifted mode DEFAULT for USARTRF_CMD */
#define USARTRF_CMD_TXTRIEN                     (0x1UL << 8)                           /**< Transmitter Tristate Enable */
#define _USARTRF_CMD_TXTRIEN_SHIFT              8                                      /**< Shift value for USART_TXTRIEN */
#define _USARTRF_CMD_TXTRIEN_MASK               0x100UL                                /**< Bit mask for USART_TXTRIEN */
#define _USARTRF_CMD_TXTRIEN_DEFAULT            0x00000000UL                           /**< Mode DEFAULT for USARTRF_CMD */
#define USARTRF_CMD_TXTRIEN_DEFAULT             (_USARTRF_CMD_TXTRIEN_DEFAULT << 8)    /**< Shifted mode DEFAULT for USARTRF_CMD */
#define USARTRF_CMD_TXTRIDIS                    (0x1UL << 9)                           /**< Transmitter Tristate Disable */
#define _USARTRF_CMD_TXTRIDIS_SHIFT             9                                      /**< Shift value for USART_TXTRIDIS */
#define _USARTRF_CMD_TXTRIDIS_MASK              0x200UL                                /**< Bit mask for USART_TXTRIDIS */
#define _USARTRF_CMD_TXTRIDIS_DEFAULT           0x00000000UL                           /**< Mode DEFAULT for USARTRF_CMD */
#define USARTRF_CMD_TXTRIDIS_DEFAULT            (_USARTRF_CMD_TXTRIDIS_DEFAULT << 9)   /**< Shifted mode DEFAULT for USARTRF_CMD */
#define USARTRF_CMD_CLEARTX                     (0x1UL << 10)                          /**< Clear TX */
#define _USARTRF_CMD_CLEARTX_SHIFT              10                                     /**< Shift value for USART_CLEARTX */
#define _USARTRF_CMD_CLEARTX_MASK               0x400UL                                /**< Bit mask for USART_CLEARTX */
#define _USARTRF_CMD_CLEARTX_DEFAULT            0x00000000UL                           /**< Mode DEFAULT for USARTRF_CMD */
#define USARTRF_CMD_CLEARTX_DEFAULT             (_USARTRF_CMD_CLEARTX_DEFAULT << 10)   /**< Shifted mode DEFAULT for USARTRF_CMD */
#define USARTRF_CMD_CLEARRX                     (0x1UL << 11)                          /**< Clear RX */
#define _USARTRF_CMD_CLEARRX_SHIFT              11                                     /**< Shift value for USART_CLEARRX */
#define _USARTRF_CMD_CLEARRX_MASK               0x800UL                                /**< Bit mask for USART_CLEARRX */
#define _USARTRF_CMD_CLEARRX_DEFAULT            0x00000000UL                           /**< Mode DEFAULT for USARTRF_CMD */
#define USARTRF_CMD_CLEARRX_DEFAULT             (_USARTRF_CMD_CLEARRX_DEFAULT << 11)   /**< Shifted mode DEFAULT for USARTRF_CMD */

