RIOT-OS/RIOT/cpu/ezr32lg/include/ezr32lg_usartrf.h
/* Bit fields for USARTRF TXDOUBLEX */
#define _USARTRF_TXDOUBLEX_RESETVALUE           0x00000000UL                                /**< Default value for USARTRF_TXDOUBLEX */
#define _USARTRF_TXDOUBLEX_MASK                 0xF9FFF9FFUL                                /**< Mask for USARTRF_TXDOUBLEX */
#define _USARTRF_TXDOUBLEX_TXDATA0_SHIFT        0                                           /**< Shift value for USART_TXDATA0 */
#define _USARTRF_TXDOUBLEX_TXDATA0_MASK         0x1FFUL                                     /**< Bit mask for USART_TXDATA0 */
#define _USARTRF_TXDOUBLEX_TXDATA0_DEFAULT      0x00000000UL                                /**< Mode DEFAULT for USARTRF_TXDOUBLEX */
#define USARTRF_TXDOUBLEX_TXDATA0_DEFAULT       (_USARTRF_TXDOUBLEX_TXDATA0_DEFAULT << 0)   /**< Shifted mode DEFAULT for USARTRF_TXDOUBLEX */
#define USARTRF_TXDOUBLEX_UBRXAT0               (0x1UL << 11)                               /**< Unblock RX After Transmission */
#define _USARTRF_TXDOUBLEX_UBRXAT0_SHIFT        11                                          /**< Shift value for USART_UBRXAT0 */
#define _USARTRF_TXDOUBLEX_UBRXAT0_MASK         0x800UL                                     /**< Bit mask for USART_UBRXAT0 */
#define _USARTRF_TXDOUBLEX_UBRXAT0_DEFAULT      0x00000000UL                                /**< Mode DEFAULT for USARTRF_TXDOUBLEX */
#define USARTRF_TXDOUBLEX_UBRXAT0_DEFAULT       (_USARTRF_TXDOUBLEX_UBRXAT0_DEFAULT << 11)  /**< Shifted mode DEFAULT for USARTRF_TXDOUBLEX */
#define USARTRF_TXDOUBLEX_TXTRIAT0              (0x1UL << 12)                               /**< Set TXTRI After Transmission */
#define _USARTRF_TXDOUBLEX_TXTRIAT0_SHIFT       12                                          /**< Shift value for USART_TXTRIAT0 */
#define _USARTRF_TXDOUBLEX_TXTRIAT0_MASK        0x1000UL                                    /**< Bit mask for USART_TXTRIAT0 */
#define _USARTRF_TXDOUBLEX_TXTRIAT0_DEFAULT     0x00000000UL                                /**< Mode DEFAULT for USARTRF_TXDOUBLEX */
#define USARTRF_TXDOUBLEX_TXTRIAT0_DEFAULT      (_USARTRF_TXDOUBLEX_TXTRIAT0_DEFAULT << 12) /**< Shifted mode DEFAULT for USARTRF_TXDOUBLEX */
#define USARTRF_TXDOUBLEX_TXBREAK0              (0x1UL << 13)                               /**< Transmit Data As Break */
#define _USARTRF_TXDOUBLEX_TXBREAK0_SHIFT       13                                          /**< Shift value for USART_TXBREAK0 */
#define _USARTRF_TXDOUBLEX_TXBREAK0_MASK        0x2000UL                                    /**< Bit mask for USART_TXBREAK0 */
#define _USARTRF_TXDOUBLEX_TXBREAK0_DEFAULT     0x00000000UL                                /**< Mode DEFAULT for USARTRF_TXDOUBLEX */
#define USARTRF_TXDOUBLEX_TXBREAK0_DEFAULT      (_USARTRF_TXDOUBLEX_TXBREAK0_DEFAULT << 13) /**< Shifted mode DEFAULT for USARTRF_TXDOUBLEX */
#define USARTRF_TXDOUBLEX_TXDISAT0              (0x1UL << 14)                               /**< Clear TXEN After Transmission */
#define _USARTRF_TXDOUBLEX_TXDISAT0_SHIFT       14                                          /**< Shift value for USART_TXDISAT0 */
#define _USARTRF_TXDOUBLEX_TXDISAT0_MASK        0x4000UL                                    /**< Bit mask for USART_TXDISAT0 */
#define _USARTRF_TXDOUBLEX_TXDISAT0_DEFAULT     0x00000000UL                                /**< Mode DEFAULT for USARTRF_TXDOUBLEX */
#define USARTRF_TXDOUBLEX_TXDISAT0_DEFAULT      (_USARTRF_TXDOUBLEX_TXDISAT0_DEFAULT << 14) /**< Shifted mode DEFAULT for USARTRF_TXDOUBLEX */
#define USARTRF_TXDOUBLEX_RXENAT0               (0x1UL << 15)                               /**< Enable RX After Transmission */
#define _USARTRF_TXDOUBLEX_RXENAT0_SHIFT        15                                          /**< Shift value for USART_RXENAT0 */
#define _USARTRF_TXDOUBLEX_RXENAT0_MASK         0x8000UL                                    /**< Bit mask for USART_RXENAT0 */
#define _USARTRF_TXDOUBLEX_RXENAT0_DEFAULT      0x00000000UL                                /**< Mode DEFAULT for USARTRF_TXDOUBLEX */
#define USARTRF_TXDOUBLEX_RXENAT0_DEFAULT       (_USARTRF_TXDOUBLEX_RXENAT0_DEFAULT << 15)  /**< Shifted mode DEFAULT for USARTRF_TXDOUBLEX */
#define _USARTRF_TXDOUBLEX_TXDATA1_SHIFT        16                                          /**< Shift value for USART_TXDATA1 */
#define _USARTRF_TXDOUBLEX_TXDATA1_MASK         0x1FF0000UL                                 /**< Bit mask for USART_TXDATA1 */
#define _USARTRF_TXDOUBLEX_TXDATA1_DEFAULT      0x00000000UL                                /**< Mode DEFAULT for USARTRF_TXDOUBLEX */
#define USARTRF_TXDOUBLEX_TXDATA1_DEFAULT       (_USARTRF_TXDOUBLEX_TXDATA1_DEFAULT << 16)  /**< Shifted mode DEFAULT for USARTRF_TXDOUBLEX */
#define USARTRF_TXDOUBLEX_UBRXAT1               (0x1UL << 27)                               /**< Unblock RX After Transmission */
#define _USARTRF_TXDOUBLEX_UBRXAT1_SHIFT        27                                          /**< Shift value for USART_UBRXAT1 */
#define _USARTRF_TXDOUBLEX_UBRXAT1_MASK         0x8000000UL                                 /**< Bit mask for USART_UBRXAT1 */
#define _USARTRF_TXDOUBLEX_UBRXAT1_DEFAULT      0x00000000UL                                /**< Mode DEFAULT for USARTRF_TXDOUBLEX */
#define USARTRF_TXDOUBLEX_UBRXAT1_DEFAULT       (_USARTRF_TXDOUBLEX_UBRXAT1_DEFAULT << 27)  /**< Shifted mode DEFAULT for USARTRF_TXDOUBLEX */
#define USARTRF_TXDOUBLEX_TXTRIAT1              (0x1UL << 28)                               /**< Set TXTRI After Transmission */
#define _USARTRF_TXDOUBLEX_TXTRIAT1_SHIFT       28                                          /**< Shift value for USART_TXTRIAT1 */
#define _USARTRF_TXDOUBLEX_TXTRIAT1_MASK        0x10000000UL                                /**< Bit mask for USART_TXTRIAT1 */
#define _USARTRF_TXDOUBLEX_TXTRIAT1_DEFAULT     0x00000000UL                                /**< Mode DEFAULT for USARTRF_TXDOUBLEX */
#define USARTRF_TXDOUBLEX_TXTRIAT1_DEFAULT      (_USARTRF_TXDOUBLEX_TXTRIAT1_DEFAULT << 28) /**< Shifted mode DEFAULT for USARTRF_TXDOUBLEX */
#define USARTRF_TXDOUBLEX_TXBREAK1              (0x1UL << 29)                               /**< Transmit Data As Break */
#define _USARTRF_TXDOUBLEX_TXBREAK1_SHIFT       29                                          /**< Shift value for USART_TXBREAK1 */
#define _USARTRF_TXDOUBLEX_TXBREAK1_MASK        0x20000000UL                                /**< Bit mask for USART_TXBREAK1 */
#define _USARTRF_TXDOUBLEX_TXBREAK1_DEFAULT     0x00000000UL                                /**< Mode DEFAULT for USARTRF_TXDOUBLEX */
#define USARTRF_TXDOUBLEX_TXBREAK1_DEFAULT      (_USARTRF_TXDOUBLEX_TXBREAK1_DEFAULT << 29) /**< Shifted mode DEFAULT for USARTRF_TXDOUBLEX */
#define USARTRF_TXDOUBLEX_TXDISAT1              (0x1UL << 30)                               /**< Clear TXEN After Transmission */
#define _USARTRF_TXDOUBLEX_TXDISAT1_SHIFT       30                                          /**< Shift value for USART_TXDISAT1 */
#define _USARTRF_TXDOUBLEX_TXDISAT1_MASK        0x40000000UL                                /**< Bit mask for USART_TXDISAT1 */
#define _USARTRF_TXDOUBLEX_TXDISAT1_DEFAULT     0x00000000UL                                /**< Mode DEFAULT for USARTRF_TXDOUBLEX */
#define USARTRF_TXDOUBLEX_TXDISAT1_DEFAULT      (_USARTRF_TXDOUBLEX_TXDISAT1_DEFAULT << 30) /**< Shifted mode DEFAULT for USARTRF_TXDOUBLEX */
#define USARTRF_TXDOUBLEX_RXENAT1               (0x1UL << 31)                               /**< Enable RX After Transmission */
#define _USARTRF_TXDOUBLEX_RXENAT1_SHIFT        31                                          /**< Shift value for USART_RXENAT1 */
#define _USARTRF_TXDOUBLEX_RXENAT1_MASK         0x80000000UL                                /**< Bit mask for USART_RXENAT1 */
#define _USARTRF_TXDOUBLEX_RXENAT1_DEFAULT      0x00000000UL                                /**< Mode DEFAULT for USARTRF_TXDOUBLEX */
#define USARTRF_TXDOUBLEX_RXENAT1_DEFAULT       (_USARTRF_TXDOUBLEX_RXENAT1_DEFAULT << 31)  /**< Shifted mode DEFAULT for USARTRF_TXDOUBLEX */

/* Bit fields for USARTRF TXDOUBLE */
#define _USARTRF_TXDOUBLE_RESETVALUE            0x00000000UL                             /**< Default value for USARTRF_TXDOUBLE */
#define _USARTRF_TXDOUBLE_MASK                  0x0000FFFFUL                             /**< Mask for USARTRF_TXDOUBLE */
#define _USARTRF_TXDOUBLE_TXDATA0_SHIFT         0                                        /**< Shift value for USART_TXDATA0 */
#define _USARTRF_TXDOUBLE_TXDATA0_MASK          0xFFUL                                   /**< Bit mask for USART_TXDATA0 */
#define _USARTRF_TXDOUBLE_TXDATA0_DEFAULT       0x00000000UL                             /**< Mode DEFAULT for USARTRF_TXDOUBLE */
#define USARTRF_TXDOUBLE_TXDATA0_DEFAULT        (_USARTRF_TXDOUBLE_TXDATA0_DEFAULT << 0) /**< Shifted mode DEFAULT for USARTRF_TXDOUBLE */
#define _USARTRF_TXDOUBLE_TXDATA1_SHIFT         8                                        /**< Shift value for USART_TXDATA1 */
#define _USARTRF_TXDOUBLE_TXDATA1_MASK          0xFF00UL                                 /**< Bit mask for USART_TXDATA1 */
#define _USARTRF_TXDOUBLE_TXDATA1_DEFAULT       0x00000000UL                             /**< Mode DEFAULT for USARTRF_TXDOUBLE */
#define USARTRF_TXDOUBLE_TXDATA1_DEFAULT        (_USARTRF_TXDOUBLE_TXDATA1_DEFAULT << 8) /**< Shifted mode DEFAULT for USARTRF_TXDOUBLE */

/* Bit fields for USARTRF IF */
#define _USARTRF_IF_RESETVALUE                  0x00000002UL                       /**< Default value for USARTRF_IF */
#define _USARTRF_IF_MASK                        0x00001FFFUL                       /**< Mask for USARTRF_IF */
#define USARTRF_IF_TXC                          (0x1UL << 0)                       /**< TX Complete Interrupt Flag */
#define _USARTRF_IF_TXC_SHIFT                   0                                  /**< Shift value for USART_TXC */
#define _USARTRF_IF_TXC_MASK                    0x1UL                              /**< Bit mask for USART_TXC */
#define _USARTRF_IF_TXC_DEFAULT                 0x00000000UL                       /**< Mode DEFAULT for USARTRF_IF */
#define USARTRF_IF_TXC_DEFAULT                  (_USARTRF_IF_TXC_DEFAULT << 0)     /**< Shifted mode DEFAULT for USARTRF_IF */
#define USARTRF_IF_TXBL                         (0x1UL << 1)                       /**< TX Buffer Level Interrupt Flag */
#define _USARTRF_IF_TXBL_SHIFT                  1                                  /**< Shift value for USART_TXBL */
#define _USARTRF_IF_TXBL_MASK                   0x2UL                              /**< Bit mask for USART_TXBL */
#define _USARTRF_IF_TXBL_DEFAULT                0x00000001UL                       /**< Mode DEFAULT for USARTRF_IF */
#define USARTRF_IF_TXBL_DEFAULT                 (_USARTRF_IF_TXBL_DEFAULT << 1)    /**< Shifted mode DEFAULT for USARTRF_IF */
#define USARTRF_IF_RXDATAV                      (0x1UL << 2)                       /**< RX Data Valid Interrupt Flag */
#define _USARTRF_IF_RXDATAV_SHIFT               2                                  /**< Shift value for USART_RXDATAV */
#define _USARTRF_IF_RXDATAV_MASK                0x4UL                              /**< Bit mask for USART_RXDATAV */
#define _USARTRF_IF_RXDATAV_DEFAULT             0x00000000UL                       /**< Mode DEFAULT for USARTRF_IF */
#define USARTRF_IF_RXDATAV_DEFAULT              (_USARTRF_IF_RXDATAV_DEFAULT << 2) /**< Shifted mode DEFAULT for USARTRF_IF */
#define USARTRF_IF_RXFULL                       (0x1UL << 3)                       /**< RX Buffer Full Interrupt Flag */
#define _USARTRF_IF_RXFULL_SHIFT                3                                  /**< Shift value for USART_RXFULL */
#define _USARTRF_IF_RXFULL_MASK                 0x8UL                              /**< Bit mask for USART_RXFULL */
#define _USARTRF_IF_RXFULL_DEFAULT              0x00000000UL                       /**< Mode DEFAULT for USARTRF_IF */
#define USARTRF_IF_RXFULL_DEFAULT               (_USARTRF_IF_RXFULL_DEFAULT << 3)  /**< Shifted mode DEFAULT for USARTRF_IF */
#define USARTRF_IF_RXOF                         (0x1UL << 4)                       /**< RX Overflow Interrupt Flag */
#define _USARTRF_IF_RXOF_SHIFT                  4                                  /**< Shift value for USART_RXOF */
#define _USARTRF_IF_RXOF_MASK                   0x10UL                             /**< Bit mask for USART_RXOF */
#define _USARTRF_IF_RXOF_DEFAULT                0x00000000UL                       /**< Mode DEFAULT for USARTRF_IF */
#define USARTRF_IF_RXOF_DEFAULT                 (_USARTRF_IF_RXOF_DEFAULT << 4)    /**< Shifted mode DEFAULT for USARTRF_IF */
#define USARTRF_IF_RXUF                         (0x1UL << 5)                       /**< RX Underflow Interrupt Flag */
#define _USARTRF_IF_RXUF_SHIFT                  5                                  /**< Shift value for USART_RXUF */
#define _USARTRF_IF_RXUF_MASK                   0x20UL                             /**< Bit mask for USART_RXUF */
#define _USARTRF_IF_RXUF_DEFAULT                0x00000000UL                       /**< Mode DEFAULT for USARTRF_IF */
#define USARTRF_IF_RXUF_DEFAULT                 (_USARTRF_IF_RXUF_DEFAULT << 5)    /**< Shifted mode DEFAULT for USARTRF_IF */
#define USARTRF_IF_TXOF                         (0x1UL << 6)                       /**< TX Overflow Interrupt Flag */
#define _USARTRF_IF_TXOF_SHIFT                  6                                  /**< Shift value for USART_TXOF */
#define _USARTRF_IF_TXOF_MASK                   0x40UL                             /**< Bit mask for USART_TXOF */
#define _USARTRF_IF_TXOF_DEFAULT                0x00000000UL                       /**< Mode DEFAULT for USARTRF_IF */
#define USARTRF_IF_TXOF_DEFAULT                 (_USARTRF_IF_TXOF_DEFAULT << 6)    /**< Shifted mode DEFAULT for USARTRF_IF */
#define USARTRF_IF_TXUF                         (0x1UL << 7)                       /**< TX Underflow Interrupt Flag */
#define _USARTRF_IF_TXUF_SHIFT                  7                                  /**< Shift value for USART_TXUF */
#define _USARTRF_IF_TXUF_MASK                   0x80UL                             /**< Bit mask for USART_TXUF */
#define _USARTRF_IF_TXUF_DEFAULT                0x00000000UL                       /**< Mode DEFAULT for USARTRF_IF */
#define USARTRF_IF_TXUF_DEFAULT                 (_USARTRF_IF_TXUF_DEFAULT << 7)    /**< Shifted mode DEFAULT for USARTRF_IF */
#define USARTRF_IF_PERR                         (0x1UL << 8)                       /**< Parity Error Interrupt Flag */
#define _USARTRF_IF_PERR_SHIFT                  8                                  /**< Shift value for USART_PERR */
#define _USARTRF_IF_PERR_MASK                   0x100UL                            /**< Bit mask for USART_PERR */
#define _USARTRF_IF_PERR_DEFAULT                0x00000000UL                       /**< Mode DEFAULT for USARTRF_IF */
#define USARTRF_IF_PERR_DEFAULT                 (_USARTRF_IF_PERR_DEFAULT << 8)    /**< Shifted mode DEFAULT for USARTRF_IF */
#define USARTRF_IF_FERR                         (0x1UL << 9)                       /**< Framing Error Interrupt Flag */
#define _USARTRF_IF_FERR_SHIFT                  9                                  /**< Shift value for USART_FERR */
#define _USARTRF_IF_FERR_MASK                   0x200UL                            /**< Bit mask for USART_FERR */
#define _USARTRF_IF_FERR_DEFAULT                0x00000000UL                       /**< Mode DEFAULT for USARTRF_IF */
#define USARTRF_IF_FERR_DEFAULT                 (_USARTRF_IF_FERR_DEFAULT << 9)    /**< Shifted mode DEFAULT for USARTRF_IF */
#define USARTRF_IF_MPAF                         (0x1UL << 10)                      /**< Multi-Processor Address Frame Interrupt Flag */
#define _USARTRF_IF_MPAF_SHIFT                  10                                 /**< Shift value for USART_MPAF */
#define _USARTRF_IF_MPAF_MASK                   0x400UL                            /**< Bit mask for USART_MPAF */
#define _USARTRF_IF_MPAF_DEFAULT                0x00000000UL                       /**< Mode DEFAULT for USARTRF_IF */
#define USARTRF_IF_MPAF_DEFAULT                 (_USARTRF_IF_MPAF_DEFAULT << 10)   /**< Shifted mode DEFAULT for USARTRF_IF */
#define USARTRF_IF_SSM                          (0x1UL << 11)                      /**< Slave-Select In Master Mode Interrupt Flag */
#define _USARTRF_IF_SSM_SHIFT                   11                                 /**< Shift value for USART_SSM */
#define _USARTRF_IF_SSM_MASK                    0x800UL                            /**< Bit mask for USART_SSM */
#define _USARTRF_IF_SSM_DEFAULT                 0x00000000UL                       /**< Mode DEFAULT for USARTRF_IF */
#define USARTRF_IF_SSM_DEFAULT                  (_USARTRF_IF_SSM_DEFAULT << 11)    /**< Shifted mode DEFAULT for USARTRF_IF */
#define USARTRF_IF_CCF                          (0x1UL << 12)                      /**< Collision Check Fail Interrupt Flag */
#define _USARTRF_IF_CCF_SHIFT                   12                                 /**< Shift value for USART_CCF */
#define _USARTRF_IF_CCF_MASK                    0x1000UL                           /**< Bit mask for USART_CCF */
#define _USARTRF_IF_CCF_DEFAULT                 0x00000000UL                       /**< Mode DEFAULT for USARTRF_IF */
#define USARTRF_IF_CCF_DEFAULT                  (_USARTRF_IF_CCF_DEFAULT << 12)    /**< Shifted mode DEFAULT for USARTRF_IF */

