RIOT-OS/RIOT/cpu/ezr32lg/include/ezr32lg_usartrf.h
/* Bit fields for USARTRF I2SCTRL */
#define _USARTRF_I2SCTRL_RESETVALUE             0x00000000UL                             /**< Default value for USARTRF_I2SCTRL */
#define _USARTRF_I2SCTRL_MASK                   0x0000071FUL                             /**< Mask for USARTRF_I2SCTRL */
#define USARTRF_I2SCTRL_EN                      (0x1UL << 0)                             /**< Enable I2S Mode */
#define _USARTRF_I2SCTRL_EN_SHIFT               0                                        /**< Shift value for USART_EN */
#define _USARTRF_I2SCTRL_EN_MASK                0x1UL                                    /**< Bit mask for USART_EN */
#define _USARTRF_I2SCTRL_EN_DEFAULT             0x00000000UL                             /**< Mode DEFAULT for USARTRF_I2SCTRL */
#define USARTRF_I2SCTRL_EN_DEFAULT              (_USARTRF_I2SCTRL_EN_DEFAULT << 0)       /**< Shifted mode DEFAULT for USARTRF_I2SCTRL */
#define USARTRF_I2SCTRL_MONO                    (0x1UL << 1)                             /**< Stero or Mono */
#define _USARTRF_I2SCTRL_MONO_SHIFT             1                                        /**< Shift value for USART_MONO */
#define _USARTRF_I2SCTRL_MONO_MASK              0x2UL                                    /**< Bit mask for USART_MONO */
#define _USARTRF_I2SCTRL_MONO_DEFAULT           0x00000000UL                             /**< Mode DEFAULT for USARTRF_I2SCTRL */
#define USARTRF_I2SCTRL_MONO_DEFAULT            (_USARTRF_I2SCTRL_MONO_DEFAULT << 1)     /**< Shifted mode DEFAULT for USARTRF_I2SCTRL */
#define USARTRF_I2SCTRL_JUSTIFY                 (0x1UL << 2)                             /**< Justification of I2S Data */
#define _USARTRF_I2SCTRL_JUSTIFY_SHIFT          2                                        /**< Shift value for USART_JUSTIFY */
#define _USARTRF_I2SCTRL_JUSTIFY_MASK           0x4UL                                    /**< Bit mask for USART_JUSTIFY */
#define _USARTRF_I2SCTRL_JUSTIFY_DEFAULT        0x00000000UL                             /**< Mode DEFAULT for USARTRF_I2SCTRL */
#define _USARTRF_I2SCTRL_JUSTIFY_LEFT           0x00000000UL                             /**< Mode LEFT for USARTRF_I2SCTRL */
#define _USARTRF_I2SCTRL_JUSTIFY_RIGHT          0x00000001UL                             /**< Mode RIGHT for USARTRF_I2SCTRL */
#define USARTRF_I2SCTRL_JUSTIFY_DEFAULT         (_USARTRF_I2SCTRL_JUSTIFY_DEFAULT << 2)  /**< Shifted mode DEFAULT for USARTRF_I2SCTRL */
#define USARTRF_I2SCTRL_JUSTIFY_LEFT            (_USARTRF_I2SCTRL_JUSTIFY_LEFT << 2)     /**< Shifted mode LEFT for USARTRF_I2SCTRL */
#define USARTRF_I2SCTRL_JUSTIFY_RIGHT           (_USARTRF_I2SCTRL_JUSTIFY_RIGHT << 2)    /**< Shifted mode RIGHT for USARTRF_I2SCTRL */
#define USARTRF_I2SCTRL_DMASPLIT                (0x1UL << 3)                             /**< Separate DMA Request For Left/Right Data */
#define _USARTRF_I2SCTRL_DMASPLIT_SHIFT         3                                        /**< Shift value for USART_DMASPLIT */
#define _USARTRF_I2SCTRL_DMASPLIT_MASK          0x8UL                                    /**< Bit mask for USART_DMASPLIT */
#define _USARTRF_I2SCTRL_DMASPLIT_DEFAULT       0x00000000UL                             /**< Mode DEFAULT for USARTRF_I2SCTRL */
#define USARTRF_I2SCTRL_DMASPLIT_DEFAULT        (_USARTRF_I2SCTRL_DMASPLIT_DEFAULT << 3) /**< Shifted mode DEFAULT for USARTRF_I2SCTRL */
#define USARTRF_I2SCTRL_DELAY                   (0x1UL << 4)                             /**< Delay on I2S data */
#define _USARTRF_I2SCTRL_DELAY_SHIFT            4                                        /**< Shift value for USART_DELAY */
#define _USARTRF_I2SCTRL_DELAY_MASK             0x10UL                                   /**< Bit mask for USART_DELAY */
#define _USARTRF_I2SCTRL_DELAY_DEFAULT          0x00000000UL                             /**< Mode DEFAULT for USARTRF_I2SCTRL */
#define USARTRF_I2SCTRL_DELAY_DEFAULT           (_USARTRF_I2SCTRL_DELAY_DEFAULT << 4)    /**< Shifted mode DEFAULT for USARTRF_I2SCTRL */
#define _USARTRF_I2SCTRL_FORMAT_SHIFT           8                                        /**< Shift value for USART_FORMAT */
#define _USARTRF_I2SCTRL_FORMAT_MASK            0x700UL                                  /**< Bit mask for USART_FORMAT */
#define _USARTRF_I2SCTRL_FORMAT_DEFAULT         0x00000000UL                             /**< Mode DEFAULT for USARTRF_I2SCTRL */
#define _USARTRF_I2SCTRL_FORMAT_W32D32          0x00000000UL                             /**< Mode W32D32 for USARTRF_I2SCTRL */
#define _USARTRF_I2SCTRL_FORMAT_W32D24M         0x00000001UL                             /**< Mode W32D24M for USARTRF_I2SCTRL */
#define _USARTRF_I2SCTRL_FORMAT_W32D24          0x00000002UL                             /**< Mode W32D24 for USARTRF_I2SCTRL */
#define _USARTRF_I2SCTRL_FORMAT_W32D16          0x00000003UL                             /**< Mode W32D16 for USARTRF_I2SCTRL */
#define _USARTRF_I2SCTRL_FORMAT_W32D8           0x00000004UL                             /**< Mode W32D8 for USARTRF_I2SCTRL */
#define _USARTRF_I2SCTRL_FORMAT_W16D16          0x00000005UL                             /**< Mode W16D16 for USARTRF_I2SCTRL */
#define _USARTRF_I2SCTRL_FORMAT_W16D8           0x00000006UL                             /**< Mode W16D8 for USARTRF_I2SCTRL */
#define _USARTRF_I2SCTRL_FORMAT_W8D8            0x00000007UL                             /**< Mode W8D8 for USARTRF_I2SCTRL */
#define USARTRF_I2SCTRL_FORMAT_DEFAULT          (_USARTRF_I2SCTRL_FORMAT_DEFAULT << 8)   /**< Shifted mode DEFAULT for USARTRF_I2SCTRL */
#define USARTRF_I2SCTRL_FORMAT_W32D32           (_USARTRF_I2SCTRL_FORMAT_W32D32 << 8)    /**< Shifted mode W32D32 for USARTRF_I2SCTRL */
#define USARTRF_I2SCTRL_FORMAT_W32D24M          (_USARTRF_I2SCTRL_FORMAT_W32D24M << 8)   /**< Shifted mode W32D24M for USARTRF_I2SCTRL */
#define USARTRF_I2SCTRL_FORMAT_W32D24           (_USARTRF_I2SCTRL_FORMAT_W32D24 << 8)    /**< Shifted mode W32D24 for USARTRF_I2SCTRL */
#define USARTRF_I2SCTRL_FORMAT_W32D16           (_USARTRF_I2SCTRL_FORMAT_W32D16 << 8)    /**< Shifted mode W32D16 for USARTRF_I2SCTRL */
#define USARTRF_I2SCTRL_FORMAT_W32D8            (_USARTRF_I2SCTRL_FORMAT_W32D8 << 8)     /**< Shifted mode W32D8 for USARTRF_I2SCTRL */
#define USARTRF_I2SCTRL_FORMAT_W16D16           (_USARTRF_I2SCTRL_FORMAT_W16D16 << 8)    /**< Shifted mode W16D16 for USARTRF_I2SCTRL */
#define USARTRF_I2SCTRL_FORMAT_W16D8            (_USARTRF_I2SCTRL_FORMAT_W16D8 << 8)     /**< Shifted mode W16D8 for USARTRF_I2SCTRL */
#define USARTRF_I2SCTRL_FORMAT_W8D8             (_USARTRF_I2SCTRL_FORMAT_W8D8 << 8)      /**< Shifted mode W8D8 for USARTRF_I2SCTRL */

/** @} End of group EZR32LG_USARTRF */
/** @} End of group Parts */

#ifdef __cplusplus
}
#endif
